name: "detector_yolov4_1_class_ensemble_nodec"
platform: "ensemble"
max_batch_size: 1
input [
  {
    name: "INPUT_01_IMAGES"
    data_type: TYPE_UINT8
    dims: [ -1, -1, -1 ]
  }
]
output [
  {
    name: "OUTPUT_01_CLASS"
    data_type: TYPE_INT32
    dims: [ -1 ]
  },
  {
    name: "OUTPUT_01_BOXES"
    data_type: TYPE_INT32
    dims: [ -1, 4 ]
  },
  {
    name: "OUTPUT_01_PROBS"
    data_type: TYPE_FP16
    dims: [ -1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "detector_yolov4_1_class_dali_nodec"
      model_version: -1
      input_map {
        key: "DALI_INPUT_0"
        value: "INPUT_01_IMAGES"
      }
      output_map {
        key: "DALI_OUTPUT_0"
        value: "preprocessed_image"
      }
      output_map {
        key: "DALI_OUTPUT_1"
        value: "original_shape"
      } 
      output_map {
        key: "DALI_OUTPUT_2"
        value: "postprocessed_shape"
      }
    },
    {
      model_name: "detector_yolov4_1_class_trt"
      model_version: -1
      input_map {
        key: "000_net"
        value: "preprocessed_image"
      }
      output_map {
        key: "(Unnamed Layer* 515) [PluginV2IOExt]_output_0"
        value: "YOLO_OUTPUT_1"
      }
      output_map {
        key: "(Unnamed Layer* 516) [PluginV2IOExt]_output_0"
        value: "YOLO_OUTPUT_2"
      }
      output_map {
        key: "(Unnamed Layer* 517) [PluginV2IOExt]_output_0"
        value: "YOLO_OUTPUT_3"
      }
    },
    {
      model_name: "detector_yolov4_1_class_post"
      model_version: -1
      input_map {
        key: "YOLO_01"
        value: "YOLO_OUTPUT_1"
      }
      input_map {
        key: "YOLO_02"
        value: "YOLO_OUTPUT_2"
      }
      input_map {
        key: "YOLO_03"
        value: "YOLO_OUTPUT_3"
      }
      input_map {
        key: "ORIG_SHAPE"
        value: "original_shape"
      }
      input_map {
        key: "POST_SHAPE"
        value: "postprocessed_shape"
      }
      output_map {
        key: "OUTPUT0"
        value: "OUTPUT_01_BOXES"
      }
      output_map {
        key: "OUTPUT1"
        value: "OUTPUT_01_PROBS"
      }
      output_map {
        key: "OUTPUT2"
        value: "OUTPUT_01_CLASS"
      }
    }
  ]
}